MikroElektronika/core_packages/PIC/XC8/def/PIC18LF8493/mcu.h
extern volatile __bit                   SEG19COM1           __at(0x7B43);	// @ (0xF68 * 8 + 3)
#define                                 SEG19COM1_bit       _BIT_ACCESS(LCDDATA8,3)
// LCDDATA14<SEG19COM2>
extern volatile __bit                   SEG19COM2           __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 SEG19COM2_bit       _BIT_ACCESS(LCDDATA14,3)
// LCDDATA20<SEG19COM3>
extern volatile __bit                   SEG19COM3           __at(0x7BCB);	// @ (0xF79 * 8 + 3)
#define                                 SEG19COM3_bit       _BIT_ACCESS(LCDDATA20,3)
// LCDDATA0<SEG1COM0>
extern volatile __bit                   SEG1COM0            __at(0x7B01);	// @ (0xF60 * 8 + 1)
#define                                 SEG1COM0_bit        _BIT_ACCESS(LCDDATA0,1)
// LCDDATA6<SEG1COM1>
extern volatile __bit                   SEG1COM1            __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 SEG1COM1_bit        _BIT_ACCESS(LCDDATA6,1)
// LCDDATA12<SEG1COM2>
extern volatile __bit                   SEG1COM2            __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 SEG1COM2_bit        _BIT_ACCESS(LCDDATA12,1)
// LCDDATA18<SEG1COM3>
extern volatile __bit                   SEG1COM3            __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 SEG1COM3_bit        _BIT_ACCESS(LCDDATA18,1)
// PORTD<SEG2>
extern volatile __bit                   SEG2                __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 SEG2_bit            _BIT_ACCESS(PORTD,2)
// PORTF<SEG20>
extern volatile __bit                   SEG20               __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 SEG20_bit           _BIT_ACCESS(PORTF,2)
// LCDDATA2<SEG20COM0>
extern volatile __bit                   SEG20COM0           __at(0x7B14);	// @ (0xF62 * 8 + 4)
#define                                 SEG20COM0_bit       _BIT_ACCESS(LCDDATA2,4)
// LCDDATA8<SEG20COM1>
extern volatile __bit                   SEG20COM1           __at(0x7B44);	// @ (0xF68 * 8 + 4)
#define                                 SEG20COM1_bit       _BIT_ACCESS(LCDDATA8,4)
// LCDDATA14<SEG20COM2>
extern volatile __bit                   SEG20COM2           __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 SEG20COM2_bit       _BIT_ACCESS(LCDDATA14,4)
// LCDDATA20<SEG20COM3>
extern volatile __bit                   SEG20COM3           __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 SEG20COM3_bit       _BIT_ACCESS(LCDDATA20,4)
// PORTF<SEG21>
extern volatile __bit                   SEG21               __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 SEG21_bit           _BIT_ACCESS(PORTF,3)
// LCDDATA2<SEG21COM0>
extern volatile __bit                   SEG21COM0           __at(0x7B15);	// @ (0xF62 * 8 + 5)
#define                                 SEG21COM0_bit       _BIT_ACCESS(LCDDATA2,5)
// LCDDATA8<SEG21COM1>
extern volatile __bit                   SEG21COM1           __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 SEG21COM1_bit       _BIT_ACCESS(LCDDATA8,5)
// LCDDATA14<SEG21COM2>
extern volatile __bit                   SEG21COM2           __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 SEG21COM2_bit       _BIT_ACCESS(LCDDATA14,5)
// LCDDATA20<SEG21COM3>
extern volatile __bit                   SEG21COM3           __at(0x7BCD);	// @ (0xF79 * 8 + 5)
#define                                 SEG21COM3_bit       _BIT_ACCESS(LCDDATA20,5)
// PORTF<SEG22>
extern volatile __bit                   SEG22               __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 SEG22_bit           _BIT_ACCESS(PORTF,4)
// LCDDATA2<SEG22COM0>
extern volatile __bit                   SEG22COM0           __at(0x7B16);	// @ (0xF62 * 8 + 6)
#define                                 SEG22COM0_bit       _BIT_ACCESS(LCDDATA2,6)
// LCDDATA8<SEG22COM1>
extern volatile __bit                   SEG22COM1           __at(0x7B46);	// @ (0xF68 * 8 + 6)
#define                                 SEG22COM1_bit       _BIT_ACCESS(LCDDATA8,6)
// LCDDATA14<SEG22COM2>
extern volatile __bit                   SEG22COM2           __at(0x7B9E);	// @ (0xF73 * 8 + 6)
#define                                 SEG22COM2_bit       _BIT_ACCESS(LCDDATA14,6)
// LCDDATA20<SEG22COM3>
extern volatile __bit                   SEG22COM3           __at(0x7BCE);	// @ (0xF79 * 8 + 6)
#define                                 SEG22COM3_bit       _BIT_ACCESS(LCDDATA20,6)
// PORTF<SEG23>
extern volatile __bit                   SEG23               __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 SEG23_bit           _BIT_ACCESS(PORTF,5)
// LCDDATA2<SEG23COM0>
extern volatile __bit                   SEG23COM0           __at(0x7B17);	// @ (0xF62 * 8 + 7)
#define                                 SEG23COM0_bit       _BIT_ACCESS(LCDDATA2,7)
// LCDDATA8<SEG23COM1>
extern volatile __bit                   SEG23COM1           __at(0x7B47);	// @ (0xF68 * 8 + 7)
#define                                 SEG23COM1_bit       _BIT_ACCESS(LCDDATA8,7)
// LCDDATA14<SEG23COM2>
extern volatile __bit                   SEG23COM2           __at(0x7B9F);	// @ (0xF73 * 8 + 7)
#define                                 SEG23COM2_bit       _BIT_ACCESS(LCDDATA14,7)
// LCDDATA20<SEG23COM3>
extern volatile __bit                   SEG23COM3           __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 SEG23COM3_bit       _BIT_ACCESS(LCDDATA20,7)
// PORTF<SEG24>
extern volatile __bit                   SEG24               __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 SEG24_bit           _BIT_ACCESS(PORTF,6)
// LCDDATA3<SEG24COM0>
extern volatile __bit                   SEG24COM0           __at(0x7B18);	// @ (0xF63 * 8 + 0)
#define                                 SEG24COM0_bit       _BIT_ACCESS(LCDDATA3,0)
// LCDDATA9<SEG24COM1>
extern volatile __bit                   SEG24COM1           __at(0x7B48);	// @ (0xF69 * 8 + 0)
#define                                 SEG24COM1_bit       _BIT_ACCESS(LCDDATA9,0)
// LCDDATA15<SEG24COM2>
extern volatile __bit                   SEG24COM2           __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 SEG24COM2_bit       _BIT_ACCESS(LCDDATA15,0)
// LCDDATA21<SEG24COM3>
extern volatile __bit                   SEG24COM3           __at(0x7BD0);	// @ (0xF7A * 8 + 0)
#define                                 SEG24COM3_bit       _BIT_ACCESS(LCDDATA21,0)
// PORTF<SEG25>
extern volatile __bit                   SEG25               __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 SEG25_bit           _BIT_ACCESS(PORTF,7)
// LCDDATA3<SEG25COM0>
extern volatile __bit                   SEG25COM0           __at(0x7B19);	// @ (0xF63 * 8 + 1)
#define                                 SEG25COM0_bit       _BIT_ACCESS(LCDDATA3,1)
// LCDDATA9<SEG25COM1>
extern volatile __bit                   SEG25COM1           __at(0x7B49);	// @ (0xF69 * 8 + 1)
#define                                 SEG25COM1_bit       _BIT_ACCESS(LCDDATA9,1)
// LCDDATA15<SEG25COM2>
extern volatile __bit                   SEG25COM2           __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 SEG25COM2_bit       _BIT_ACCESS(LCDDATA15,1)
// LCDDATA21<SEG25COM3>
extern volatile __bit                   SEG25COM3           __at(0x7BD1);	// @ (0xF7A * 8 + 1)
#define                                 SEG25COM3_bit       _BIT_ACCESS(LCDDATA21,1)
// PORTG<SEG26>
extern volatile __bit                   SEG26               __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 SEG26_bit           _BIT_ACCESS(PORTG,4)
// LCDDATA3<SEG26COM0>
extern volatile __bit                   SEG26COM0           __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 SEG26COM0_bit       _BIT_ACCESS(LCDDATA3,2)
// LCDDATA9<SEG26COM1>
extern volatile __bit                   SEG26COM1           __at(0x7B4A);	// @ (0xF69 * 8 + 2)
#define                                 SEG26COM1_bit       _BIT_ACCESS(LCDDATA9,2)
// LCDDATA15<SEG26COM2>
extern volatile __bit                   SEG26COM2           __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 SEG26COM2_bit       _BIT_ACCESS(LCDDATA15,2)
// LCDDATA21<SEG26COM3>
extern volatile __bit                   SEG26COM3           __at(0x7BD2);	// @ (0xF7A * 8 + 2)
#define                                 SEG26COM3_bit       _BIT_ACCESS(LCDDATA21,2)
// PORTG<SEG27>
extern volatile __bit                   SEG27               __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 SEG27_bit           _BIT_ACCESS(PORTG,3)
// LCDDATA3<SEG27COM0>
extern volatile __bit                   SEG27COM0           __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 SEG27COM0_bit       _BIT_ACCESS(LCDDATA3,3)
// LCDDATA9<SEG27COM1>
extern volatile __bit                   SEG27COM1           __at(0x7B4B);	// @ (0xF69 * 8 + 3)
#define                                 SEG27COM1_bit       _BIT_ACCESS(LCDDATA9,3)
// LCDDATA15<SEG27COM2>
extern volatile __bit                   SEG27COM2           __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 SEG27COM2_bit       _BIT_ACCESS(LCDDATA15,3)
// LCDDATA21<SEG27COM3>
extern volatile __bit                   SEG27COM3           __at(0x7BD3);	// @ (0xF7A * 8 + 3)
#define                                 SEG27COM3_bit       _BIT_ACCESS(LCDDATA21,3)
// PORTG<SEG28>
extern volatile __bit                   SEG28               __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 SEG28_bit           _BIT_ACCESS(PORTG,2)
// LCDDATA3<SEG28COM0>
extern volatile __bit                   SEG28COM0           __at(0x7B1C);	// @ (0xF63 * 8 + 4)
#define                                 SEG28COM0_bit       _BIT_ACCESS(LCDDATA3,4)
// LCDDATA9<SEG28COM1>
extern volatile __bit                   SEG28COM1           __at(0x7B4C);	// @ (0xF69 * 8 + 4)
#define                                 SEG28COM1_bit       _BIT_ACCESS(LCDDATA9,4)
// LCDDATA15<SEG28COM2>
extern volatile __bit                   SEG28COM2           __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 SEG28COM2_bit       _BIT_ACCESS(LCDDATA15,4)
// LCDDATA21<SEG28COM3>
extern volatile __bit                   SEG28COM3           __at(0x7BD4);	// @ (0xF7A * 8 + 4)
#define                                 SEG28COM3_bit       _BIT_ACCESS(LCDDATA21,4)
// PORTG<SEG29>
extern volatile __bit                   SEG29               __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 SEG29_bit           _BIT_ACCESS(PORTG,1)
// LCDDATA3<SEG29COM0>
extern volatile __bit                   SEG29COM0           __at(0x7B1D);	// @ (0xF63 * 8 + 5)
#define                                 SEG29COM0_bit       _BIT_ACCESS(LCDDATA3,5)
// LCDDATA9<SEG29COM1>
extern volatile __bit                   SEG29COM1           __at(0x7B4D);	// @ (0xF69 * 8 + 5)
#define                                 SEG29COM1_bit       _BIT_ACCESS(LCDDATA9,5)
// LCDDATA15<SEG29COM2>
extern volatile __bit                   SEG29COM2           __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 SEG29COM2_bit       _BIT_ACCESS(LCDDATA15,5)
// LCDDATA21<SEG29COM3>
extern volatile __bit                   SEG29COM3           __at(0x7BD5);	// @ (0xF7A * 8 + 5)
#define                                 SEG29COM3_bit       _BIT_ACCESS(LCDDATA21,5)
// LCDDATA0<SEG2COM0>
extern volatile __bit                   SEG2COM0            __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 SEG2COM0_bit        _BIT_ACCESS(LCDDATA0,2)
// LCDDATA6<SEG2COM1>
extern volatile __bit                   SEG2COM1            __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 SEG2COM1_bit        _BIT_ACCESS(LCDDATA6,2)
// LCDDATA12<SEG2COM2>
extern volatile __bit                   SEG2COM2            __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 SEG2COM2_bit        _BIT_ACCESS(LCDDATA12,2)
// LCDDATA18<SEG2COM3>
extern volatile __bit                   SEG2COM3            __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 SEG2COM3_bit        _BIT_ACCESS(LCDDATA18,2)
// PORTD<SEG3>
extern volatile __bit                   SEG3                __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 SEG3_bit            _BIT_ACCESS(PORTD,3)
// PORTG<SEG30>
extern volatile __bit                   SEG30               __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 SEG30_bit           _BIT_ACCESS(PORTG,0)
// LCDDATA3<SEG30COM0>
extern volatile __bit                   SEG30COM0           __at(0x7B1E);	// @ (0xF63 * 8 + 6)
#define                                 SEG30COM0_bit       _BIT_ACCESS(LCDDATA3,6)
// LCDDATA9<SEG30COM1>
extern volatile __bit                   SEG30COM1           __at(0x7B4E);	// @ (0xF69 * 8 + 6)
#define                                 SEG30COM1_bit       _BIT_ACCESS(LCDDATA9,6)
// LCDDATA15<SEG30COM2>
extern volatile __bit                   SEG30COM2           __at(0x7BA6);	// @ (0xF74 * 8 + 6)
#define                                 SEG30COM2_bit       _BIT_ACCESS(LCDDATA15,6)
// LCDDATA21<SEG30COM3>
extern volatile __bit                   SEG30COM3           __at(0x7BD6);	// @ (0xF7A * 8 + 6)
#define                                 SEG30COM3_bit       _BIT_ACCESS(LCDDATA21,6)
// PORTE<SEG31>
extern volatile __bit                   SEG31               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 SEG31_bit           _BIT_ACCESS(PORTE,7)
// LCDDATA3<SEG31COM0>
extern volatile __bit                   SEG31COM0           __at(0x7B1F);	// @ (0xF63 * 8 + 7)
#define                                 SEG31COM0_bit       _BIT_ACCESS(LCDDATA3,7)
// LCDDATA9<SEG31COM1>
extern volatile __bit                   SEG31COM1           __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 SEG31COM1_bit       _BIT_ACCESS(LCDDATA9,7)
// LCDDATA15<SEG31COM2>
extern volatile __bit                   SEG31COM2           __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 SEG31COM2_bit       _BIT_ACCESS(LCDDATA15,7)
// LCDDATA21<SEG31COM3>
extern volatile __bit                   SEG31COM3           __at(0x7BD7);	// @ (0xF7A * 8 + 7)
#define                                 SEG31COM3_bit       _BIT_ACCESS(LCDDATA21,7)
// PORTJ<SEG32>
extern volatile __bit                   SEG32               __at(0x7C40);	// @ (0xF88 * 8 + 0)
#define                                 SEG32_bit           _BIT_ACCESS(PORTJ,0)
// LCDDATA4<SEG32COM0>
extern volatile __bit                   SEG32COM0           __at(0x7B20);	// @ (0xF64 * 8 + 0)
#define                                 SEG32COM0_bit       _BIT_ACCESS(LCDDATA4,0)
// LCDDATA10<SEG32COM1>
extern volatile __bit                   SEG32COM1           __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 SEG32COM1_bit       _BIT_ACCESS(LCDDATA10,0)
// LCDDATA16<SEG32COM2>
extern volatile __bit                   SEG32COM2           __at(0x7BA8);	// @ (0xF75 * 8 + 0)
#define                                 SEG32COM2_bit       _BIT_ACCESS(LCDDATA16,0)
// LCDDATA22<SEG32COM3>
extern volatile __bit                   SEG32COM3           __at(0x7BD8);	// @ (0xF7B * 8 + 0)
#define                                 SEG32COM3_bit       _BIT_ACCESS(LCDDATA22,0)
// PORTJ<SEG33>
extern volatile __bit                   SEG33               __at(0x7C41);	// @ (0xF88 * 8 + 1)
#define                                 SEG33_bit           _BIT_ACCESS(PORTJ,1)
// LCDDATA4<SEG33COM0>
extern volatile __bit                   SEG33COM0           __at(0x7B21);	// @ (0xF64 * 8 + 1)
#define                                 SEG33COM0_bit       _BIT_ACCESS(LCDDATA4,1)
// LCDDATA10<SEG33COM1>
extern volatile __bit                   SEG33COM1           __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 SEG33COM1_bit       _BIT_ACCESS(LCDDATA10,1)
// LCDDATA16<SEG33COM2>
extern volatile __bit                   SEG33COM2           __at(0x7BA9);	// @ (0xF75 * 8 + 1)
#define                                 SEG33COM2_bit       _BIT_ACCESS(LCDDATA16,1)
// LCDDATA22<SEG33COM3>
extern volatile __bit                   SEG33COM3           __at(0x7BD9);	// @ (0xF7B * 8 + 1)
#define                                 SEG33COM3_bit       _BIT_ACCESS(LCDDATA22,1)
// PORTJ<SEG34>
extern volatile __bit                   SEG34               __at(0x7C42);	// @ (0xF88 * 8 + 2)
#define                                 SEG34_bit           _BIT_ACCESS(PORTJ,2)
// LCDDATA4<SEG34COM0>
extern volatile __bit                   SEG34COM0           __at(0x7B22);	// @ (0xF64 * 8 + 2)
#define                                 SEG34COM0_bit       _BIT_ACCESS(LCDDATA4,2)
// LCDDATA10<SEG34COM1>
extern volatile __bit                   SEG34COM1           __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 SEG34COM1_bit       _BIT_ACCESS(LCDDATA10,2)
// LCDDATA16<SEG34COM2>
extern volatile __bit                   SEG34COM2           __at(0x7BAA);	// @ (0xF75 * 8 + 2)
#define                                 SEG34COM2_bit       _BIT_ACCESS(LCDDATA16,2)
// LCDDATA22<SEG34COM3>
extern volatile __bit                   SEG34COM3           __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 SEG34COM3_bit       _BIT_ACCESS(LCDDATA22,2)
// PORTJ<SEG35>
extern volatile __bit                   SEG35               __at(0x7C43);	// @ (0xF88 * 8 + 3)
#define                                 SEG35_bit           _BIT_ACCESS(PORTJ,3)
// LCDDATA4<SEG35COM0>
extern volatile __bit                   SEG35COM0           __at(0x7B23);	// @ (0xF64 * 8 + 3)
#define                                 SEG35COM0_bit       _BIT_ACCESS(LCDDATA4,3)
// LCDDATA10<SEG35COM1>
extern volatile __bit                   SEG35COM1           __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 SEG35COM1_bit       _BIT_ACCESS(LCDDATA10,3)
// LCDDATA16<SEG35COM2>
extern volatile __bit                   SEG35COM2           __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 SEG35COM2_bit       _BIT_ACCESS(LCDDATA16,3)
// LCDDATA22<SEG35COM3>
extern volatile __bit                   SEG35COM3           __at(0x7BDB);	// @ (0xF7B * 8 + 3)
#define                                 SEG35COM3_bit       _BIT_ACCESS(LCDDATA22,3)
// PORTJ<SEG36>
extern volatile __bit                   SEG36               __at(0x7C47);	// @ (0xF88 * 8 + 7)
#define                                 SEG36_bit           _BIT_ACCESS(PORTJ,7)
// LCDDATA4<SEG36COM0>
extern volatile __bit                   SEG36COM0           __at(0x7B24);	// @ (0xF64 * 8 + 4)
#define                                 SEG36COM0_bit       _BIT_ACCESS(LCDDATA4,4)
// LCDDATA10<SEG36COM1>
extern volatile __bit                   SEG36COM1           __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 SEG36COM1_bit       _BIT_ACCESS(LCDDATA10,4)
// LCDDATA16<SEG36COM2>
extern volatile __bit                   SEG36COM2           __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 SEG36COM2_bit       _BIT_ACCESS(LCDDATA16,4)
// LCDDATA22<SEG36COM3>
extern volatile __bit                   SEG36COM3           __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 SEG36COM3_bit       _BIT_ACCESS(LCDDATA22,4)
// PORTJ<SEG37>
extern volatile __bit                   SEG37               __at(0x7C46);	// @ (0xF88 * 8 + 6)
#define                                 SEG37_bit           _BIT_ACCESS(PORTJ,6)
// LCDDATA4<SEG37COM0>
extern volatile __bit                   SEG37COM0           __at(0x7B25);	// @ (0xF64 * 8 + 5)
#define                                 SEG37COM0_bit       _BIT_ACCESS(LCDDATA4,5)
// LCDDATA10<SEG37COM1>
extern volatile __bit                   SEG37COM1           __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 SEG37COM1_bit       _BIT_ACCESS(LCDDATA10,5)
// LCDDATA16<SEG37COM2>
extern volatile __bit                   SEG37COM2           __at(0x7BAD);	// @ (0xF75 * 8 + 5)
#define                                 SEG37COM2_bit       _BIT_ACCESS(LCDDATA16,5)
// LCDDATA22<SEG37COM3>
extern volatile __bit                   SEG37COM3           __at(0x7BDD);	// @ (0xF7B * 8 + 5)
#define                                 SEG37COM3_bit       _BIT_ACCESS(LCDDATA22,5)
// PORTJ<SEG38>
extern volatile __bit                   SEG38               __at(0x7C45);	// @ (0xF88 * 8 + 5)
#define                                 SEG38_bit           _BIT_ACCESS(PORTJ,5)
// LCDDATA4<SEG38COM0>
extern volatile __bit                   SEG38COM0           __at(0x7B26);	// @ (0xF64 * 8 + 6)
#define                                 SEG38COM0_bit       _BIT_ACCESS(LCDDATA4,6)
// LCDDATA10<SEG38COM1>
extern volatile __bit                   SEG38COM1           __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 SEG38COM1_bit       _BIT_ACCESS(LCDDATA10,6)
// LCDDATA16<SEG38COM2>
extern volatile __bit                   SEG38COM2           __at(0x7BAE);	// @ (0xF75 * 8 + 6)
#define                                 SEG38COM2_bit       _BIT_ACCESS(LCDDATA16,6)
// LCDDATA22<SEG38COM3>
extern volatile __bit                   SEG38COM3           __at(0x7BDE);	// @ (0xF7B * 8 + 6)
#define                                 SEG38COM3_bit       _BIT_ACCESS(LCDDATA22,6)
// PORTJ<SEG39>
extern volatile __bit                   SEG39               __at(0x7C44);	// @ (0xF88 * 8 + 4)
#define                                 SEG39_bit           _BIT_ACCESS(PORTJ,4)
// LCDDATA4<SEG39COM0>
extern volatile __bit                   SEG39COM0           __at(0x7B27);	// @ (0xF64 * 8 + 7)
#define                                 SEG39COM0_bit       _BIT_ACCESS(LCDDATA4,7)
// LCDDATA10<SEG39COM1>
extern volatile __bit                   SEG39COM1           __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 SEG39COM1_bit       _BIT_ACCESS(LCDDATA10,7)
// LCDDATA16<SEG39COM2>
extern volatile __bit                   SEG39COM2           __at(0x7BAF);	// @ (0xF75 * 8 + 7)
#define                                 SEG39COM2_bit       _BIT_ACCESS(LCDDATA16,7)
// LCDDATA22<SEG39COM3>
extern volatile __bit                   SEG39COM3           __at(0x7BDF);	// @ (0xF7B * 8 + 7)
#define                                 SEG39COM3_bit       _BIT_ACCESS(LCDDATA22,7)
// LCDDATA0<SEG3COM0>
extern volatile __bit                   SEG3COM0            __at(0x7B03);	// @ (0xF60 * 8 + 3)
#define                                 SEG3COM0_bit        _BIT_ACCESS(LCDDATA0,3)
// LCDDATA6<SEG3COM1>
extern volatile __bit                   SEG3COM1            __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 SEG3COM1_bit        _BIT_ACCESS(LCDDATA6,3)
// LCDDATA12<SEG3COM2>
extern volatile __bit                   SEG3COM2            __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 SEG3COM2_bit        _BIT_ACCESS(LCDDATA12,3)
// LCDDATA18<SEG3COM3>
extern volatile __bit                   SEG3COM3            __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 SEG3COM3_bit        _BIT_ACCESS(LCDDATA18,3)
// PORTD<SEG4>
extern volatile __bit                   SEG4                __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 SEG4_bit            _BIT_ACCESS(PORTD,4)
// PORTH<SEG40>
extern volatile __bit                   SEG40               __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 SEG40_bit           _BIT_ACCESS(PORTH,4)
// LCDDATA5<SEG40COM0>
extern volatile __bit                   SEG40COM0           __at(0x7B28);	// @ (0xF65 * 8 + 0)
